Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_18 (Separab (None, 128, 126, 126)     5060      
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 64, 63, 126)       0         
_________________________________________________________________
separable_conv2d_19 (Separab (None, 128, 61, 124)      8896      
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 64, 30, 124)       0         
_________________________________________________________________
separable_conv2d_20 (Separab (None, 128, 28, 122)      8896      
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 64, 14, 122)       0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 109312)            0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 109312)            0         
_________________________________________________________________
dense_12 (Dense)             (None, 32)                3498016   
_________________________________________________________________
dense_13 (Dense)             (None, 10)                330       
=================================================================
Total params: 3,521,198
Trainable params: 3,521,198
Non-trainable params: 0
_________________________________________________________________
